In [2]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.api as sm
import statsmodels.formula.api as smf
import statsmodels.graphics.api as smg
from scipy import stats

In [2]:
t = np.matrix([[73,21,16,11],[45,36,24,9]])

In [3]:
q = stats.chi2_contingency(t)
q

Chi2ContingencyResult(statistic=12.193744836893364, pvalue=0.006748100370291122, dof=3, expected_freq=array([[60.75744681, 29.34893617, 20.59574468, 10.29787234],
       [57.24255319, 27.65106383, 19.40425532,  9.70212766]]))

In [4]:
np.sqrt((12.19/235))  #cramers coeficient

0.2277550008793043

In [5]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
tab = pd.crosstab(df['class'],df['survived'])
tab

survived    0    1
class
First      80  136
Second     97   87
Third     372  119

In [10]:
tab.sum()

survived
0    549
1    342
dtype: int64

In [7]:
o = stats.chi2_contingency(tab)
o

Chi2ContingencyResult(statistic=102.88898875696056, pvalue=4.549251711298793e-23, dof=2, expected_freq=array([[133.09090909,  82.90909091],
       [113.37373737,  70.62626263],
       [302.53535354, 188.46464646]]))

In [8]:
u = np.sqrt(102.88/(549+342))
u

0.33980254383848

In [9]:
c= np.sqrt((102.88/(102.88+549+342)))
c

0.3217351436137077

In [3]:
pizza = pd.read_excel('D:\LabHw\DescriptiveStat\data\pizza.xlsx')
pizza

<>:1: SyntaxWarning: invalid escape sequence '\L'
<>:1: SyntaxWarning: invalid escape sequence '\L'
C:\Users\Administrator\AppData\Local\Temp\ipykernel_6904\2853958894.py:1: SyntaxWarning: invalid escape sequence '\L'
  pizza = pd.read_excel('D:\LabHw\DescriptiveStat\data\pizza.xlsx')

,index,date,week,weekday,area,count,rabate,price,operator,driver,delivery_min,temperature,wine_ordered,wine_delivered,wrongpizza,quality
0,1,2014-03-01,9.0,6.0,Camden,5.0,1.0,65.655,Rhonda,Taylor,20.0,53.0,0.0,0.0,0.0,medium
1,2,2014-03-01,9.0,6.0,Westminster,2.0,0.0,26.980,Rhonda,Butcher,19.6,56.4,0.0,0.0,0.0,high
2,3,2014-03-01,9.0,6.0,Westminster,3.0,0.0,40.970,Allanah,Butcher,17.8,36.5,0.0,0.0,0.0,NaN
3,4,2014-03-01,9.0,6.0,Brent,2.0,0.0,25.980,Allanah,Taylor,37.3,NaN,0.0,0.0,0.0,NaN
4,5,2014-03-01,9.0,6.0,Brent,5.0,1.0,57.555,Rhonda,Carter,21.8,50.0,0.0,0.0,0.0,medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1204,1205,2014-03-31,14.0,1.0,Westminster,3.0,0.0,41.970,Rhonda,Farmer,31.2,35.7,0.0,0.0,0.0,low
1205,1206,2014-03-31,14.0,1.0,Camden,3.0,0.0,42.970,Rhonda,Carter,12.3,48.3,0.0,0.0,0.0,medium
1206,1207,2014-03-31,14.0,1.0,Brent,2.0,0.0,26.980,Rhonda,Carter,9.1,45.7,0.0,0.0,0.0,medium
1207,1208,2014-03-31,14.0,1.0,Brent,6.0,1.0,75.546,Rhonda,Carpenter,11.0,43.8,0.0,0.0,0.0,medium
1208,1209,2014-03-31,14.0,1.0,Camden,4.0,1.0,69.660,Rhonda,Farmer,15.0,43.5,1.0,1.0,0.0,medium

In [5]:
driver = pizza['driver']
winedelivered = pizza['wine_delivered']
table = pd.crosstab(driver, winedelivered)
table

wine_delivered  0.0  1.0
driver
Butcher          85    9
Carpenter       214   56
Carter          212   19
Farmer          100   17
Hunter          139   15
Miller          109   16
Taylor          172   29

In [6]:
c= stats.chi2_contingency(table)
c

Chi2ContingencyResult(statistic=21.02895299841279, pvalue=0.0018127696556709742, dof=6, expected_freq=array([[ 81.30369128,  12.69630872],
       [233.53187919,  36.46812081],
       [199.79949664,  31.20050336],
       [101.19714765,  15.80285235],
       [133.19966443,  20.80033557],
       [108.11661074,  16.88338926],
       [173.85151007,  27.14848993]]))

In [7]:
table.sum()

wine_delivered
0.0    1031
1.0     161
dtype: int64

In [8]:
f = np.sqrt(21.02/(1031+161))
f

0.13279393129175543